CFDEM/CFDEMcoupling-PUBLIC-5.x/tutorials/ErgunTestMPI_interDyMFoam/CFD/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//phases (water air);
transportModel  Newtonian;
nu              nu [ 0 2 -1 0 0 0 0 ] 1e-3;

water   //water;
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-3; //1e-06; //8.9e-04;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}

air  //olive oil
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-2; //1e-06; //0.1;// at 23 //1.48e-05;
    rho             rho [ 1 -3 0 0 0 0 0 ] 996.0;  // at 15.6 degree celcius
}    



sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.03;
theta 		theta [ 0 0 0 0 0 0 0 ] 0.0;
/*
transportModel  Newtonian;

rho             
nu              nu [ 0 2 -1 0 0 0 0 ] 1.5e-04;

CrossPowerLawCoeffs
{
    nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
    nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
    m               m [ 0 0 1 0 0 0 0 ] 1;
    n               n [ 0 0 0 0 0 0 0 ] 1;
}

BirdCarreauCoeffs
{
    nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
    nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
    k               k [ 0 0 1 0 0 0 0 ] 0;
    n               n [ 0 0 0 0 0 0 0 ] 1;
*/
}
// ************************************************************************* //
