CFDEM/CFDEMcoupling-PUBLIC-5.x/tutorials/ErgunTestMPI_interDyMFoam/CFD/0/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
	
        type            inletOutlet;
        value           uniform 2;
        inletValue      uniform 2;
	
         //type            zeroGradient;
/*
         type           constantAlphaContactAngle;
        theta0         0;
        limit          gradient;
        value          uniform 0;
*/
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {

        type           constantAlphaContactAngle;
        theta0         45;
        limit          gradient;
        value          uniform 0;

    }

}


// ************************************************************************* //
