CFDEM/CFDEMcoupling-PUBLIC-5.x/tutorials/ErgunTestMPI_interDyMFoam/CFD/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
/*
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.1;
    }
*/
     "alpha.water.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;
        cAlpha          1;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        minIter         1;
        maxIter         1000;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    p_rgh//pd
    {
	solver		PCG;
	preconditioner  
	{
	   preconditioner GAMG;
	   tolerance	1e-08;
	   relTol	0;
	   nVcycles	2;
	   smoother        GaussSeidel;
	   nPreSweeps      0;
	   nPostSweeps     2;
	   nFinestSweeps   2;
	   cacheAgglomeration false;
	   nCellsInCoarsestLevel 10;
	   agglomerator    faceAreaPair;
	   mergeLevels     1;
	}
	tolerance	1e-08;
	relTol		0;
	maxIter		20;
    }

    pd
    {
	solver		PCG;
	preconditioner  
	{
	   preconditioner GAMG;
	   tolerance	1e-08;
	   relTol	0;
	   nVcycles	2;
	   smoother        GaussSeidel;
	   nPreSweeps      0;
	   nPostSweeps     2;
	   nFinestSweeps   2;
	   cacheAgglomeration false;
	   nCellsInCoarsestLevel 10;
	   agglomerator    faceAreaPair;
	   mergeLevels     1;
	}
	tolerance	1e-08;
	relTol		0;
	maxIter		20;
    }

    p_rghFinal//pdFinal
    {
	solver		PCG;
	preconditioner  
	{
	   preconditioner GAMG;
	   tolerance	1e-08;
	   relTol	0;
	   nVcycles	2;
	   smoother        GaussSeidel;
	   nPreSweeps      0;
	   nPostSweeps     2;
	   nFinestSweeps   2;
	   cacheAgglomeration false;
	   nCellsInCoarsestLevel 10;
	   agglomerator    faceAreaPair;
	   mergeLevels     1;
	}
	tolerance	1e-08;
	relTol		0;
	maxIter		20;
    }

    pdFinal
    {
	solver		PCG;
	preconditioner  
	{
	   preconditioner GAMG;
	   tolerance	1e-08;
	   relTol	0;
	   nVcycles	2;
	   smoother        GaussSeidel;
	   nPreSweeps      0;
	   nPostSweeps     2;
	   nFinestSweeps   2;
	   cacheAgglomeration false;
	   nCellsInCoarsestLevel 10;
	   agglomerator    faceAreaPair;
	   mergeLevels     1;
	}
	tolerance	1e-08;
	relTol		0;
	maxIter		20;
    }

    pFinal
    {
	solver		PCG;
	preconditioner  
	{
	   preconditioner GAMG;
	   tolerance	1e-08;
	   relTol	0;
	   nVcycles	2;
	   smoother        GaussSeidel;
	   nPreSweeps      0;
	   nPostSweeps     2;
	   nFinestSweeps   2;
	   cacheAgglomeration false;
	   nCellsInCoarsestLevel 10;
	   agglomerator    faceAreaPair;
	   mergeLevels     1;
	}
	tolerance	1e-08;
	relTol		0;
	maxIter		20;
    }

    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
    }

    pcorrFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
    }


    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k|epsilon|omega|R|nuTilda)Final"
    {
        $U;
        relTol          0;
    }

    "(voidfraction|Us|Ksl|dSmoothing|UsNext|voidfractionNext|sSmoothField|vSmoothField)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0;
    }
}

PISO
{
    nCorrectors     	4;
    nNonOrthogonalCorrectors 1;
    pRefCell       	 0;
    pRefValue       	0;
    nAlphaCorr	    	1;
    nAlphaSubCycles 	1;
    cAlpha  		2;
}
PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
    nAlphaCorr	    	1;
    nAlphaSubCycles 	1;
    cAlpha  		2;
}
relaxationFactors
{
    fields
    {
	    p	1.0;
    }
    equations
    {
        "U.*"           1.;
        "k.*"           1.;
        "epsilon.*"     1.;
    }
}


// ************************************************************************* //
