CFDEM/CFDEMcoupling-PUBLIC-5.x/tutorials/ErgunTestMPI_interDyMFoam/CFD/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(

    cylinderToCell
    {
 	p1 ( 0 0 0.000 );
	p2 ( 0 0 0.0325 );

	radius 0.3; //0.003
        //box (0 0 0) (1 1 0.0325);

        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
/*
    boxToCell
    {
	box (-0.0138 -0.0138 0) (0.0138 0.0138 0.1325);

        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }*/
);


// ************************************************************************* //
